sterentev/atdf-device-asm-include/inc/ATtiny48.inc
; ====	ASM PROGRAM SKELETON				========
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	INT_RESET	; RESET		 - External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;#		rjmp	INT_INT0	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		rjmp	INT_PCINT0	; PCINT0	 - Pin Change Interrupt Request 0
;#		reti			; PCINT1	 - Pin Change Interrupt Request 1
;#		reti			; PCINT2	 - Pin Change Interrupt Request 2
;#		reti			; PCINT3	 - Pin Change Interrupt Request 3
;#		reti			; WDT		 - Watchdog Time-out Interrupt
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_COMPA	 - TimerCounter0 Compare Match A
;#		reti			; TIMER0_COMPB	 - TimerCounter0 Compare Match B
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; SPI_STC	 - SPI Serial Transfer Complete
;#		reti			; ADC		 - ADC Conversion Complete
;#		rjmp	INT_EE_RDY	; EE_RDY	 - EEPROM Ready
;#		reti			; ANALOG_COMP	 - Analog Comparator
;#		reti			; TWI		 - Two-wire Serial Interface
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	INT_RESET:
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATTINY48_INC_ */

; ************************ END OF FILE *********************************

